In [3]:
# !pip install pandas

In [11]:
import pandas as pd
# https://pandas.pydata.org/docs/reference/index.html

In [5]:
pd.__version__

'2.3.3'

## Datatype of Pandas

1. DataFrame : 2D Table with rows and columns
2. Series : 1D array-like , can hold any data type such as integers, strings, floating-point numbers, and Python objects

## Creating DataFrame

In [8]:
data = {
    "name": ["Bob","Charls", "Aman"],
    "age": [25,35,15]
}
data

{'name': ['Bob', 'Charls', 'Aman'], 'age': [25, 35, 15]}

In [9]:
df = pd.DataFrame(data)

In [13]:
df

     name  age
0     Bob   25
1  Charls   35
2    Aman   15

## Reading Data From Files

- `pd.read_csv(file_path, delimiter=',')`: Reads CSV (Comma Separated Value) file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')

In [14]:
titanic_df = pd.read_csv("titanic_data.csv", delimiter = ",", header=0)

In [15]:
titanic_df.shape

(891, 12)

In [16]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- `pd.read_json(file_path, delimiter=',')`: Reads Json file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')

In [19]:
json_df = pd.read_json("employees.json")

In [20]:
type(json_df)

pandas.core.frame.DataFrame